{
 "cells": [
  {
   "cell_type": "markdown",
   "metadata": {
    "colab_type": "text",
    "id": "HemH_lV8lI8H"
   },
   "source": [
    "# Понятие об оптимизации"
   ]
  },
  {
   "cell_type": "markdown",
   "metadata": {
    "colab_type": "text",
    "id": "74L4paYiOO-6"
   },
   "source": [
    "## Практическое задание"
   ]
  },
  {
   "cell_type": "markdown",
   "metadata": {
    "colab_type": "text",
    "id": "lLxOGNrMOO-7"
   },
   "source": [
    "В проектируемой локальной сети есть заданное количество компьютеров. <br>\n",
    "Есть расстояния от каждого компьютера до сервера и до остальных компьютеров. <br>\n",
    "Маршрутизаторы соединяются с сервером через оптоволокно стоимостью 12 р/м, а компьютеры с маршрутизаторами соединяются через витую пару стоимостью 30 р/м. Каждый маршрутизатор имеет 8 портов для витой пары и один оптический порт.<br>\n",
    "Сервер имеет неограниченное число оптических портов и портов для витой пары. Компьютер может соединяться с сервером напрямую или через маршрутизатор.<br>\n",
    "Построить ЦФ для расчёта стоимости оборудования ЛВС в общем виде. Учесть стоимость маршрутизатора, обоснованность его установки."
   ]
  },
  {
   "cell_type": "markdown",
   "metadata": {},
   "source": [
    "Входные данные (задаются фиксированными):\n",
    "    1) N - заданное кол-во компьютеров\n",
    "    2) sc[N] - массив длиной N, расстояния от сервера до каждого компьютера\n",
    "    3) сс[N][N] - 2-мерный массив матрица расстояний между компьютерам \n",
    "    4) SM - стоимось маршрутизатора"
   ]
  },
  {
   "cell_type": "markdown",
   "metadata": {},
   "source": [
    "Параметры регулирования, которые надо оптимизировать:\n",
    "    1) M - кол-во маршрутизаторов\n",
    "    2) sm[M] - расстояние от сервера до маршрутизаторов, длины оптоволокна \n",
    "    3) mc[N] - расстояние от маршрутизаторов до компьютеров, длины витой пары\n",
    "    4) sum(sm[M]) - общая дляна оптоволокна\n",
    "    5) sum(mc[N]) - общая длина витой пары\n",
    "    6) x - кол-во компьютеров, подключенных к серверу напрямую через витую пару без маршрутизатора"
   ]
  },
  {
   "cell_type": "markdown",
   "metadata": {},
   "source": [
    "В общем случае ЦФ: cost = 12 * sum по всем M(sm) + 30 * (sum по всем N-x(mc) + sum по всем x(sc))  + M * SM, где sm - расстояние от сервера до маршрутизатора, M - кол-во маршрутизаторов, N - кол-во клиентов - рабочих станций, sc - расстояние от сервера до клиента, SM - стоимость маршрутизатора (хаба)   "
   ]
  },
  {
   "cell_type": "markdown",
   "metadata": {},
   "source": [
    "cost = sum по всем N(min(30 * sc, 12 * sm + 30 * mc, 12 * (sm - 0.5) + 30 * 0.5 + SM))\n",
    "1) 30 * sc - подключение компьютера к серверу напрямую через витую пару\n",
    "2) 12 * sm + 30 * mc - подключение через уже существующий маршрутизатор\n",
    "3) 12 * (sm - 0.5) + 30 * 0.5 + SM - постановка нового маршрутизатора рядом с компом (в 0.5 метре от компьютера)"
   ]
  },
  {
   "cell_type": "markdown",
   "metadata": {},
   "source": [
    "Программа расчета минимума целевой ф-ции:"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 5,
   "metadata": {},
   "outputs": [
    {
     "name": "stdout",
     "output_type": "stream",
     "text": [
      "Стоимость установки сети: 3377.0\n",
      "Количество маршрутизаторов: 1\n"
     ]
    }
   ],
   "source": [
    "N = 5 #заданное кол-во компьютеров \n",
    "sc = [10,20,30,40,50]#- массив длиной N, расстояния от сервера до каждого компьютера, отсортированный по возрастанию\n",
    "cc = [[0,10,20,30,40],[10,0,10,20,30],[20,10,0,10,20],[30,20,10,0,10],[40,30,20,10,0]] #- 2-мерный массив матрица расстояний между компьютерам \n",
    "SM = 500 #- стоимось маршрутизатора\n",
    "M = 0 #начальное колиество маршрутизаторов\n",
    "#sm = []\n",
    "#mc = []\n",
    "sum_cost = 0\n",
    "hubs = []\n",
    "#внешний цикл по N от 0 до N-1\n",
    "for n in range(N):\n",
    "    #1 вариант: рассчитывыем самый простой вариант - подключение через витую пару\n",
    "    min_cost = 30 * sc[n]\n",
    "    selected_m = -1\n",
    "    #2 вариант: пробуем уменьшить стоимость подключаясь через уже существующие маршрутизаторы\n",
    "    #проход по всем имеющимся маршрутизаторам\n",
    "    for m in range(M):\n",
    "        hub = hubs[m]\n",
    "        #проверка превышения лимита соединений хаба\n",
    "        if hub['count_connection'] > 8:\n",
    "            continue\n",
    "        wife_n = hub['wife_computer'] #номер \"жены\" маршрутизатора \n",
    "        mc = cc[n][wife_n] #расстояние от маршрутизатора до компа для простоты принимается равным расстоянию от жены маршрутизатора \n",
    "        #(жена в пол-метре)\n",
    "        cost = 12 * hub['sm'] + 30 * mc\n",
    "        if cost < min_cost:\n",
    "            min_cost = cost\n",
    "            selected_m = m\n",
    "     #3 вариант: вводим новый маршрутизатор и \"женим\" этот маршрутизатор на компьютере \n",
    "     # - ставим новый маршрутизатор в 0.5 м от этого компа!          \n",
    "    cost = 12 * (sc[n] - 0.5) + 0.5 * 30 + SM #нужно учесть стоимость маршрутизатора\n",
    "    if cost < min_cost:\n",
    "        min_cost = cost\n",
    "        #вводим новый маршрутизатор\n",
    "        hub = {}\n",
    "        hub['sm'] = sc[n] - 0.5\n",
    "        hub['wife_computer'] = n\n",
    "        hub['count_connection'] = 1\n",
    "        hubs.append(hub)\n",
    "        M += 1 #увеличиваем кол-во маршрутизаторов\n",
    "    else:\n",
    "        if selected_m >= 0:\n",
    "            hubs[selected_m]['count_connection'] += 1 #увеличиваем кол-во соединений\n",
    "    sum_cost += min_cost\n",
    "    \n",
    "print('Стоимость установки сети:', sum_cost)\n",
    "print('Количество маршрутизаторов:', M)\n",
    "\n",
    "\n"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": null,
   "metadata": {},
   "outputs": [],
   "source": []
  }
 ],
 "metadata": {
  "colab": {
   "collapsed_sections": [],
   "name": "Методичка 1. Методы оптимизации. Вводный.ipynb",
   "provenance": []
  },
  "kernelspec": {
   "display_name": "Python 3",
   "language": "python",
   "name": "python3"
  },
  "language_info": {
   "codemirror_mode": {
    "name": "ipython",
    "version": 3
   },
   "file_extension": ".py",
   "mimetype": "text/x-python",
   "name": "python",
   "nbconvert_exporter": "python",
   "pygments_lexer": "ipython3",
   "version": "3.7.1"
  }
 },
 "nbformat": 4,
 "nbformat_minor": 1
}
